metaneutrons/Vellum/firmware/components/epaper_uc8179/examples/esp32s3_epaper_154/sdkconfig.defaults
# ESP32-S3-ePaper-1.54 Example Configuration
# Board: Waveshare ESP32-S3-ePaper-1.54
# Panel: GDEY0154D67 (200x200 BW)

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# PSRAM (ESP32-S3-ePaper-1.54 has 2MB PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# LVGL Configuration
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y

# Fonts
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
